<a href="https://colab.research.google.com/github/psameni/INFO5731_Spring2020/blob/master/InClass_Excercise4.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Inclass_Excercise 4

In [0]:
#reading legal_case.tx file
import pandas as pd

data_file="legal_case.txt"
data=pd.read_csv(data_file,error_bad_lines=False,names=['sentence'])

## 1.1 Feature Extraction

In [0]:
#number of sentences
print("Number of Sentences :",len(data['sentence']))

Number of Sentences : 148

In [0]:
#number of words
data['word_count']=data['sentence'].apply(lambda x: len(x.split(" ")))

data[['sentence','word_count']].head()

                    sentence  word_count
0                 5 Ala. 740           3
1  Supreme Court of Alabama.           4
2                      ADAMS           1
3                         v.           1
4         TANNER AND HORTON.           3

In [0]:
#number of Characters
data['char_count']=data['sentence'].str.len()

data[['sentence','char_count']].head()

                    sentence  char_count
0                 5 Ala. 740          10
1  Supreme Court of Alabama.          25
2                      ADAMS           5
3                         v.           2
4         TANNER AND HORTON.          18

In [0]:
#avg words count
def avg_word(sentence):
    words=sentence.split()
    if len(words)!=0:
     return(sum(len(word) for word in words)/len(words))
    else:
     return 0

data['avg_word_len']=data['sentence'].apply(lambda x: avg_word(x))
data[['sentence','avg_word_len']].head()

                    sentence  avg_word_len
0                 5 Ala. 740      2.666667
1  Supreme Court of Alabama.      5.500000
2                      ADAMS      5.000000
3                         v.      2.000000
4         TANNER AND HORTON.      5.333333

In [0]:
#number of stop words

from nltk.corpus import stopwords

import nltk
nltk.download('stopwords')
stop=stopwords.words('english')

data['stop_words_count']=data['sentence'].apply(lambda x: len([y for y in x.split() if y in stop]))

data[['sentence','stop_words_count']].head()

[nltk_data] Downloading package stopwords to /root/nltk_data...
[nltk_data]   Unzipping corpora/stopwords.zip.

                    sentence  stop_words_count
0                 5 Ala. 740                 0
1  Supreme Court of Alabama.                 1
2                      ADAMS                 0
3                         v.                 0
4         TANNER AND HORTON.                 0

In [0]:
#number of special characters

data['special_char_count']=data['sentence'].apply(lambda x: len([y for y in x.split() if y.startswith(('#','@'))]))

data[['sentence','special_char_count']].head()

                    sentence  special_char_count
0                 5 Ala. 740                   0
1  Supreme Court of Alabama.                   0
2                      ADAMS                   0
3                         v.                   0
4         TANNER AND HORTON.                   0

In [0]:
#number of numerics

data['numeric_count']=data['sentence'].apply(lambda x: len([y for y in x.split() if y.isdigit()]))

data[['sentence','numeric_count']].head()

                    sentence  numeric_count
0                 5 Ala. 740              2
1  Supreme Court of Alabama.              0
2                      ADAMS              0
3                         v.              0
4         TANNER AND HORTON.              0

In [0]:
#number of uppercase words

data['uppercase_words_count']=data['sentence'].apply(lambda x: len([y for y in x.split() if y.isupper()]))

data[['sentence','uppercase_words_count']].head()

                    sentence  uppercase_words_count
0                 5 Ala. 740                      0
1  Supreme Court of Alabama.                      0
2                      ADAMS                      1
3                         v.                      0
4         TANNER AND HORTON.                      3

## 1.2 Text pre processing

In [0]:
#Lower casing
data['sentence']=data['sentence'].str.lower()
data['sentence'].head()

0                   5 ala. 740
1    supreme court of alabama.
2                        adams
3                           v.
4           tanner and horton.
Name: sentence, dtype: object

In [0]:
#Removing Punctuation
import string
data['sentence']=data['sentence'].str.replace('[{}]'.format(string.punctuation), '')
data['sentence'].head()

0                   5 ala 740
1    supreme court of alabama
2                       adams
3                           v
4           tanner and horton
Name: sentence, dtype: object

In [0]:
#Removing Stopwords
from nltk.corpus import stopwords

import nltk
nltk.download('stopwords')
stop=stopwords.words('english')

data['sentence']=data['sentence'].apply(lambda x:" ".join(x for x in x.split() if x not in stop))
data['sentence'].head()

[nltk_data] Downloading package stopwords to /root/nltk_data...
[nltk_data]   Package stopwords is already up-to-date!

0                5 ala 740
1    supreme court alabama
2                    adams
3                        v
4            tanner horton
Name: sentence, dtype: object

In [0]:
#frequent word removal
freq=pd.Series(' '.join(data['sentence']).split()).value_counts()[:10]
freq

freq=list(freq.index)

data['sentence']=data['sentence'].apply(lambda x:" ".join(x for x in x.split() if x not in freq))
data['sentence'].head()

0                740
1    supreme alabama
2              adams
3
4      tanner horton
Name: sentence, dtype: object

In [0]:
#rare word removal
freq=pd.Series(' '.join(data['sentence']).split()).value_counts()[-10:]

freq=list(freq.index)
data['sentence']=data['sentence'].apply(lambda x:" ".join(x for x in x.split() if x not in freq))
data['sentence'].head()

0                740
1    supreme alabama
2              adams
3
4      tanner horton
Name: sentence, dtype: object

In [0]:
#Spelling Correction
from textblob import TextBlob

data['sentence']=data['sentence'].apply(lambda x: str(TextBlob(x).correct()))
data['sentence'].head()

0                740
1    supreme alabama
2               adam
3
4      manner norton
Name: sentence, dtype: object

In [0]:
#stemming
from nltk.stem import PorterStemmer
st=PorterStemmer()

data['sentence']=data['sentence'].apply(lambda x: " ".join([st.stem(word) for word in x.split()]))
data['sentence'].head()

0               740
1    suprem alabama
2              adam
3
4     manner norton
Name: sentence, dtype: object

In [0]:
#Lemmetization
from textblob import Word

import nltk
nltk.download('wordnet')
data['sentence']=data['sentence'].apply(lambda x: " ".join([Word(word).lemmatize() for word in x.split()]))
data['sentence'].head()

[nltk_data] Downloading package wordnet to /root/nltk_data...
[nltk_data]   Unzipping corpora/wordnet.zip.

0               740
1    suprem alabama
2              adam
3
4     manner norton
Name: sentence, dtype: object

In [0]:
#dropping empty rows
sentence=data["sentence"] != ""
data=data[sentence]
data=data.reset_index(inplace=False)
data['sentence'].head()

0               740
1    suprem alabama
2              adam
3     manner norton
4              june
Name: sentence, dtype: object

## 1.3 Saving to a new file

In [0]:
#saving the formatted sentences to "Formatted_sentences.txt"

data['sentence'].to_csv("Formatted_sentences.txt",header=False,index=False)

## 1.4 Advance Text Processing

In [0]:
#term frequency
tf=(data['sentence']).apply(lambda x: pd.value_counts(x.split(' '))).sum(axis=0).reset_index()
tf.columns=['word','Term Frequency']
tf.head()

      word  Term Frequency
0      740             2.0
1   suprem             1.0
2  alabama             1.0
3     adam             1.0
4   norton             1.0

In [0]:
#ngram features
import nltk
nltk.download('punkt')
print("Top 10 1 grams")
for i in range(10):
 print(TextBlob(data['sentence'][i]).ngrams(1))
print("\nTop 10 2 grams")
for i in range(10):
 print(TextBlob(data['sentence'][i]).ngrams(2))
print("\nTop 10 3 grams")
for i in range(10):
 print(TextBlob(data['sentence'][i]).ngrams(3))

[nltk_data] Downloading package punkt to /root/nltk_data...
[nltk_data]   Unzipping tokenizers/punkt.zip.
Top 10 1 grams
[WordList(['740'])]
[WordList(['suprem']), WordList(['alabama'])]
[WordList(['adam'])]
[WordList(['manner']), WordList(['norton'])]
[WordList(['june'])]
[WordList(['sycosi'])]
[WordList(['writ']), WordList(['error']), WordList(['sumter'])]
[WordList(['west']), WordList(['headnot'])]
[WordList(['1'])]
[WordList(['chattel']), WordList(['mortgag'])]

Top 10 2 grams
[]
[WordList(['suprem', 'alabama'])]
[]
[WordList(['manner', 'norton'])]
[]
[]
[WordList(['writ', 'error']), WordList(['error', 'sumter'])]
[WordList(['west', 'headnot'])]
[]
[WordList(['chattel', 'mortgag'])]

Top 10 3 grams
[]
[]
[]
[]
[]
[]
[WordList(['writ', 'error', 'sumter'])]
[]
[]
[]

## 2.1 Write a Python program to remove leading zeros from an IP address.

In [0]:
#given
import re
ip="260.08.094.109"
str = re.sub('\.[0]*', '.', ip)
print(str)

260.8.94.109

## 2.2 Write a Python Program to extract all the years from the following sentence

In [0]:
#given
sentence = "The 2010s were a dramatic decade, filled with ups and downs, more than 1000 stroies have happened. As the decade comes to a close, Insider took a look back at some of the biggest headline-grabbing stories, from 2010 to 2019. The result was 119 news stories that ranged from the heartwarming rescue of a Thai boys' soccer team from a flooded cave to the divisive election of President Donald Trump."
str=re.sub('201[0-9]',' ',sentence)
str

"The  s were a dramatic decade, filled with ups and downs, more than 1000 stroies have happened. As the decade comes to a close, Insider took a look back at some of the biggest headline-grabbing stories, from   to  . The result was 119 news stories that ranged from the heartwarming rescue of a Thai boys' soccer team from a flooded cave to the divisive election of President Donald Trump."